Starting shell in Topographical mode...
setting auto_restore_mw_cel_lib_setup true
Initializing gui preferences from file  /u/pratik2/.synopsys_dv_prefs.tcl
dc_shell> source -echo -verbose ../scripts/mux.tcl
# For DIC_II in 2016 Fall:
# The  reset_design  command  removes  all  user-specified  clocks,  path
# groups, and attributes from the current design, except those defined by
# using the set_attribute command.  
# set current_design_name [current_design]
reset_design
Error: Current design is not defined. (UID-4)
0
remove_design -designs
1
set top_design mux161
mux161
lappend search_path "/pkgs/synopsys/2016/libs/SAED32_EDK/lib/stdcell_hvt/db_nldm"
. /pkgs/synopsys/2019_06/syn/P-2019.03-SP1-1/libraries/syn /pkgs/synopsys/2019_06/syn/P-2019.03-SP1-1/dw/syn_ver /pkgs/synopsys/2019_06/syn/P-2019.03-SP1-1/dw/sim_ver /pkgs/synopsys/2016/libs/SAED32_EDK/lib/stdcell_hvt/db_nldm
set link_library   "saed32hvt_ff0p95v125c.db"
saed32hvt_ff0p95v125c.db
set target_library "saed32hvt_ff0p95v125c.db"
saed32hvt_ff0p95v125c.db
# set_clock_gating_style -sequential_cell latch -positive_edge_logic {and} -negative_edge_logic {or} -minimum_bitwidth 2
analyze -format verilog /u/pratik2/Floorplan-based-synthesis/syn/scripts/mux161.v
Running PRESTO HDLC
Compiling source file /u/pratik2/Floorplan-based-synthesis/syn/scripts/mux161.v
Error:  /u/pratik2/Floorplan-based-synthesis/syn/scripts/mux161.v:1: Illegal reference to memory a. (VER-253)
Error:  /u/pratik2/Floorplan-based-synthesis/syn/scripts/mux161.v:1: Illegal reference to memory s. (VER-253)
*** Presto compilation terminated with 2 errors. ***
Loading db file '/pkgs/synopsys/2016/libs/SAED32_EDK/lib/stdcell_hvt/db_nldm/saed32hvt_ff0p95v125c.db'
0
elaborate mux161
Loading db file '/pkgs/synopsys/2019_06/syn/P-2019.03-SP1-1/libraries/syn/gtech.db'
Loading db file '/pkgs/synopsys/2019_06/syn/P-2019.03-SP1-1/libraries/syn/standard.sldb'
  Loading link library 'saed32hvt_ff0p95v125c'
  Loading link library 'gtech'
Error: Cannot find the design 'mux161' in the library 'WORK'. (LBR-0)
0
#create_clock -name "CLK" -period 0.500 -waveform {0.0 0.250} clock 
#set_clock_transition 0.100 CLK
echo "Message: Compiling the design now:"
Message: Compiling the design now:
echo "========================="
=========================
# compile -gate_clock
compile
Error: Command compile is not supported in DC Topographical mode. (OPT-1406)
0
compile_ultra
Error: Current design is not defined. (UID-4)
0
echo "Message: Compiling Ended now:"
Message: Compiling Ended now:
echo "========================="
=========================
write_file  -f verilog -h -o /u/pratik2/Floorplan-based-synthesis/syn/scripts/mux161_be.v
Error: No files or designs were specified. (UID-22)
0
#write_file  -f verilog -h -o /u/pratik2/work/QUESTA_SIM_FE_BE/back_end/Adder_be.v 
# write_file  -f ddc -h -o     /u/ataur/DIC_II_SNPS/DC/output/mapped/counter_questa.ddc
# write_sdc   -nosplit /home/ataur/DIC_II_SNPS/DC/output/mapped/counter_questa.sdc
report_cell -nosplit
Error: Current design is not defined. (UID-4)
0
0
dc_shell-topo> source -echo -verbose ../scripts/mux.tcl
# For DIC_II in 2016 Fall:
# The  reset_design  command  removes  all  user-specified  clocks,  path
# groups, and attributes from the current design, except those defined by
# using the set_attribute command.  
# set current_design_name [current_design]
reset_design
Error: Current design is not defined. (UID-4)
0
remove_design -designs
1
set top_design mux161
mux161
lappend search_path "/pkgs/synopsys/2016/libs/SAED32_EDK/lib/stdcell_hvt/db_nldm"
. /pkgs/synopsys/2019_06/syn/P-2019.03-SP1-1/libraries/syn /pkgs/synopsys/2019_06/syn/P-2019.03-SP1-1/dw/syn_ver /pkgs/synopsys/2019_06/syn/P-2019.03-SP1-1/dw/sim_ver /pkgs/synopsys/2016/libs/SAED32_EDK/lib/stdcell_hvt/db_nldm /pkgs/synopsys/2016/libs/SAED32_EDK/lib/stdcell_hvt/db_nldm
set link_library   "saed32hvt_ff0p95v125c.db"
saed32hvt_ff0p95v125c.db
set target_library "saed32hvt_ff0p95v125c.db"
saed32hvt_ff0p95v125c.db
# set_clock_gating_style -sequential_cell latch -positive_edge_logic {and} -negative_edge_logic {or} -minimum_bitwidth 2
analyze -format verilog /u/pratik2/Floorplan-based-synthesis/syn/scripts/mux161.v
Running PRESTO HDLC
Compiling source file /u/pratik2/Floorplan-based-synthesis/syn/scripts/mux161.v
Error:  /u/pratik2/Floorplan-based-synthesis/syn/scripts/mux161.v:11: Assigment to 'out' requires that it be a register. (VER-952)
Error:  /u/pratik2/Floorplan-based-synthesis/syn/scripts/mux161.v:12: Assigment to 'out' requires that it be a register. (VER-952)
Error:  /u/pratik2/Floorplan-based-synthesis/syn/scripts/mux161.v:13: Assigment to 'out' requires that it be a register. (VER-952)
Error:  /u/pratik2/Floorplan-based-synthesis/syn/scripts/mux161.v:14: Assigment to 'out' requires that it be a register. (VER-952)
Error:  /u/pratik2/Floorplan-based-synthesis/syn/scripts/mux161.v:15: Assigment to 'out' requires that it be a register. (VER-952)
Error:  /u/pratik2/Floorplan-based-synthesis/syn/scripts/mux161.v:16: Assigment to 'out' requires that it be a register. (VER-952)
Error:  /u/pratik2/Floorplan-based-synthesis/syn/scripts/mux161.v:17: Assigment to 'out' requires that it be a register. (VER-952)
Error:  /u/pratik2/Floorplan-based-synthesis/syn/scripts/mux161.v:18: Assigment to 'out' requires that it be a register. (VER-952)
Error:  /u/pratik2/Floorplan-based-synthesis/syn/scripts/mux161.v:19: Assigment to 'out' requires that it be a register. (VER-952)
Error:  /u/pratik2/Floorplan-based-synthesis/syn/scripts/mux161.v:20: Assigment to 'out' requires that it be a register. (VER-952)
Error:  /u/pratik2/Floorplan-based-synthesis/syn/scripts/mux161.v:21: Assigment to 'out' requires that it be a register. (VER-952)
Error:  /u/pratik2/Floorplan-based-synthesis/syn/scripts/mux161.v:22: Assigment to 'out' requires that it be a register. (VER-952)
Error:  /u/pratik2/Floorplan-based-synthesis/syn/scripts/mux161.v:23: Assigment to 'out' requires that it be a register. (VER-952)
Error:  /u/pratik2/Floorplan-based-synthesis/syn/scripts/mux161.v:24: Assigment to 'out' requires that it be a register. (VER-952)
Error:  /u/pratik2/Floorplan-based-synthesis/syn/scripts/mux161.v:25: Assigment to 'out' requires that it be a register. (VER-952)
Error:  /u/pratik2/Floorplan-based-synthesis/syn/scripts/mux161.v:26: Assigment to 'out' requires that it be a register. (VER-952)
Error:  /u/pratik2/Floorplan-based-synthesis/syn/scripts/mux161.v:1: Illegal reference to memory a. (VER-253)
Error:  /u/pratik2/Floorplan-based-synthesis/syn/scripts/mux161.v:1: Illegal reference to memory s. (VER-253)
*** Presto compilation terminated with 18 errors. ***
0
elaborate mux161
Error: Cannot find the design 'mux161' in the library 'WORK'. (LBR-0)
0
#create_clock -name "CLK" -period 0.500 -waveform {0.0 0.250} clock 
#set_clock_transition 0.100 CLK
echo "Message: Compiling the design now:"
Message: Compiling the design now:
echo "========================="
=========================
# compile -gate_clock
compile
Error: Command compile is not supported in DC Topographical mode. (OPT-1406)
0
compile_ultra
Error: Current design is not defined. (UID-4)
0
echo "Message: Compiling Ended now:"
Message: Compiling Ended now:
echo "========================="
=========================
write_file  -f verilog -h -o /u/pratik2/Floorplan-based-synthesis/syn/scripts/mux161_be.v
Error: No files or designs were specified. (UID-22)
0
#write_file  -f verilog -h -o /u/pratik2/work/QUESTA_SIM_FE_BE/back_end/Adder_be.v 
# write_file  -f ddc -h -o     /u/ataur/DIC_II_SNPS/DC/output/mapped/counter_questa.ddc
# write_sdc   -nosplit /home/ataur/DIC_II_SNPS/DC/output/mapped/counter_questa.sdc
report_cell -nosplit
Error: Current design is not defined. (UID-4)
0
0
dc_shell-topo> exit

Thank you...

